#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
读写文件
使用python内置函数open()来进行文件的读写操作

                        python open mode
----------------------------------------------------------------------------
r   |   以只读方式打开文件，可读取文件信息
----------------------------------------------------------------------------
w   |   以写方式打开文件，可向文件写入信息，若文件存在，则清空该文件，再写入新内容
----------------------------------------------------------------------------
a   |   已追加模式打开文件，如果文件不存在，则创建
----------------------------------------------------------------------------
r+  |   以读写方式打开文件，可对文件进行读和写操作
----------------------------------------------------------------------------
w+  |   消除文件内容，然后以读写方式打开文件
----------------------------------------------------------------------------
a+  |   以读写方式打开文件，并把文件指针移到文件尾
----------------------------------------------------------------------------
b   |   以二进制模式打开文件，而不是以文本模式
----------------------------------------------------------------------------
"""

import os

def operaFile():    #创建文件
    print(u'创建一个名为test.txt的文件，并在其中写入hello,adam')
    print(u'先确保test.txt不存在')
    os.system('rm test.txt')
    os.system('ls -l test.txt')
    print(u'现在再来创建文件并写入内容\n')
    fp = open('test.txt', 'w')
    fp.write('hello adam')
    fp.close()
    print(u'不要忘记使用close关闭文件～')
    print(u'再来看看test.txt是否存在，和内容\n')
    os.system('ls -l test.txt')
    os.system('cat test.txt')
    print('\n')

"""
    print(u'如何避免open文件失败的问题呢？')
    print(u'使用with as 就可以了')
    with open('test.txt','r') as fp:
        st = fp.read()
    print('test.txt的内容为：%s' %st)
"""


if __name__ == '__main__':
    operaFile()
